export const 二进制八卦 = [
    { id: 0, 名: '坤', 符: '☷', 别名: '地' },
    { id: 1, 名: '震', 符: '☳', 别名: '雷' },
    { id: 2, 名: '坎', 符: '☵', 别名: '水' },
    { id: 3, 名: '兑', 符: '☱', 别名: '泽' },
    { id: 4, 名: '艮', 符: '☶', 别名: '山' },
    { id: 5, 名: '离', 符: '☲', 别名: '火' },
    { id: 6, 名: '巽', 符: '☴', 别名: '风' },
    { id: 7, 名: '乾', 符: '☰', 别名: '天' },
];

export const 先天八卦 = [
    { id: 5, 名: '离', 符: '☲', 别名: '火', 号: 3 },
    { id: 3, 名: '兑', 符: '☱', 别名: '泽', 号: 2 },
    { id: 7, 名: '乾', 符: '☰', 别名: '天', 号: 1 },
    { id: 6, 名: '巽', 符: '☴', 别名: '风', 号: 5 },
    { id: 2, 名: '坎', 符: '☵', 别名: '水', 号: 6 },
    { id: 4, 名: '艮', 符: '☶', 别名: '山', 号: 7 },
    { id: 0, 名: '坤', 符: '☷', 别名: '地', 号: 8 },
    { id: 1, 名: '震', 符: '☳', 别名: '雷', 号: 4 },
];

export const 后天八卦 = [
    { id: 1, 名: '震', 符: '☳', 别名: '雷', 号: 3 },
    { id: 6, 名: '巽', 符: '☴', 别名: '风', 号: 4 },
    { id: 5, 名: '离', 符: '☲', 别名: '火', 号: 9 },
    { id: 0, 名: '坤', 符: '☷', 别名: '地', 号: 2 },
    { id: 3, 名: '兑', 符: '☱', 别名: '泽', 号: 7 },
    { id: 7, 名: '乾', 符: '☰', 别名: '天', 号: 6 },
    { id: 2, 名: '坎', 符: '☵', 别名: '水', 号: 1 },
    { id: 4, 名: '艮', 符: '☶', 别名: '山', 号: 8 },
];
